(
)
or
and
not
next
until
True
False
always
violated
success
null
eventually
release
examine
examined
cookbook
is
in
player
examine_cookbook
go_east
go_south
go_west
go_north
in_kitchen
red
potato
chopped
meal
consumed
parsley
diced
sliced
block
of
cheese
purple
white
onion
pork
chop
orange
bell
pepper
banana
yellow
hot
apple
player_went_east
player_went_west
player_went_north
player_went_south
player_at_kitchen
cookbook_is_examined
cookbook_in_player
fridge_is_open
knife_in_player
banana_in_meal
banana_in_player
banana_is_burned
banana_is_chopped
banana_is_consumed
banana_is_diced
banana_is_fried
banana_is_grilled
banana_is_roasted
banana_is_sliced
black_pepper_in_meal
black_pepper_in_player
black_pepper_is_burned
black_pepper_is_chopped
black_pepper_is_consumed
black_pepper_is_diced
black_pepper_is_fried
black_pepper_is_grilled
black_pepper_is_roasted
black_pepper_is_sliced
block_of_cheese_in_meal
block_of_cheese_in_player
block_of_cheese_is_burned
block_of_cheese_is_chopped
block_of_cheese_is_consumed
block_of_cheese_is_diced
block_of_cheese_is_fried
block_of_cheese_is_grilled
block_of_cheese_is_roasted
block_of_cheese_is_sliced
carrot_in_meal
carrot_in_player
carrot_is_burned
carrot_is_chopped
carrot_is_consumed
carrot_is_diced
carrot_is_fried
carrot_is_grilled
carrot_is_roasted
carrot_is_sliced
chicken_leg_in_meal
chicken_leg_in_player
chicken_leg_is_burned
chicken_leg_is_chopped
chicken_leg_is_consumed
chicken_leg_is_diced
chicken_leg_is_fried
chicken_leg_is_grilled
chicken_leg_is_roasted
chicken_leg_is_sliced
chicken_wing_in_meal
chicken_wing_in_player
chicken_wing_is_burned
chicken_wing_is_chopped
chicken_wing_is_consumed
chicken_wing_is_diced
chicken_wing_is_fried
chicken_wing_is_grilled
chicken_wing_is_roasted
chicken_wing_is_sliced
cilantro_in_meal
cilantro_in_player
cilantro_is_burned
cilantro_is_chopped
cilantro_is_consumed
cilantro_is_diced
cilantro_is_fried
cilantro_is_grilled
cilantro_is_roasted
cilantro_is_sliced
flour_in_meal
flour_in_player
flour_is_burned
flour_is_chopped
flour_is_consumed
flour_is_diced
flour_is_fried
flour_is_grilled
flour_is_roasted
flour_is_sliced
meal_in_meal
meal_in_player
meal_is_burned
meal_is_chopped
meal_is_consumed
meal_is_diced
meal_is_fried
meal_is_grilled
meal_is_roasted
meal_is_sliced
olive_oil_in_meal
olive_oil_in_player
olive_oil_is_burned
olive_oil_is_chopped
olive_oil_is_consumed
olive_oil_is_diced
olive_oil_is_fried
olive_oil_is_grilled
olive_oil_is_roasted
olive_oil_is_sliced
orange_bell_pepper_in_meal
orange_bell_pepper_in_player
orange_bell_pepper_is_burned
orange_bell_pepper_is_chopped
orange_bell_pepper_is_consumed
orange_bell_pepper_is_diced
orange_bell_pepper_is_fried
orange_bell_pepper_is_grilled
orange_bell_pepper_is_roasted
orange_bell_pepper_is_sliced
parsley_in_meal
parsley_in_player
parsley_is_burned
parsley_is_chopped
parsley_is_consumed
parsley_is_diced
parsley_is_fried
parsley_is_grilled
parsley_is_roasted
parsley_is_sliced
pork_chop_in_meal
pork_chop_in_player
pork_chop_is_burned
pork_chop_is_chopped
pork_chop_is_consumed
pork_chop_is_diced
pork_chop_is_fried
pork_chop_is_grilled
pork_chop_is_roasted
pork_chop_is_sliced
purple_potato_in_meal
purple_potato_in_player
purple_potato_is_burned
purple_potato_is_chopped
purple_potato_is_consumed
purple_potato_is_diced
purple_potato_is_fried
purple_potato_is_grilled
purple_potato_is_roasted
purple_potato_is_sliced
red_apple_in_meal
red_apple_in_player
red_apple_is_burned
red_apple_is_chopped
red_apple_is_consumed
red_apple_is_diced
red_apple_is_fried
red_apple_is_grilled
red_apple_is_roasted
red_apple_is_sliced
red_hot_pepper_in_meal
red_hot_pepper_in_player
red_hot_pepper_is_burned
red_hot_pepper_is_chopped
red_hot_pepper_is_consumed
red_hot_pepper_is_diced
red_hot_pepper_is_fried
red_hot_pepper_is_grilled
red_hot_pepper_is_roasted
red_hot_pepper_is_sliced
red_onion_in_meal
red_onion_in_player
red_onion_is_burned
red_onion_is_chopped
red_onion_is_consumed
red_onion_is_diced
red_onion_is_fried
red_onion_is_grilled
red_onion_is_roasted
red_onion_is_sliced
red_potato_in_meal
red_potato_in_player
red_potato_is_burned
red_potato_is_chopped
red_potato_is_consumed
red_potato_is_diced
red_potato_is_fried
red_potato_is_grilled
red_potato_is_roasted
red_potato_is_sliced
salt_in_meal
salt_in_player
salt_is_burned
salt_is_chopped
salt_is_consumed
salt_is_diced
salt_is_fried
salt_is_grilled
salt_is_roasted
salt_is_sliced
water_in_meal
water_in_player
water_is_burned
water_is_chopped
water_is_consumed
water_is_diced
water_is_fried
water_is_grilled
water_is_roasted
water_is_sliced
white_onion_in_meal
white_onion_in_player
white_onion_is_burned
white_onion_is_chopped
white_onion_is_consumed
white_onion_is_diced
white_onion_is_fried
white_onion_is_grilled
white_onion_is_roasted
white_onion_is_sliced
yellow_bell_pepper_in_meal
yellow_bell_pepper_in_player
yellow_bell_pepper_is_burned
yellow_bell_pepper_is_chopped
yellow_bell_pepper_is_consumed
yellow_bell_pepper_is_diced
yellow_bell_pepper_is_fried
yellow_bell_pepper_is_grilled
yellow_bell_pepper_is_roasted
yellow_bell_pepper_is_sliced
yellow_potato_in_meal
yellow_potato_in_player
yellow_potato_is_burned
yellow_potato_is_chopped
yellow_potato_is_consumed
yellow_potato_is_diced
yellow_potato_is_fried
yellow_potato_is_grilled
yellow_potato_is_roasted
yellow_potato_is_sliced
